In [128]:
import pandas as pd

In [129]:
orders_data =  pd.read_csv("orders_data.csv")

In [130]:
orders_df = pd.DataFrame(orders_data) #converts the dataset to Pandas Data Frame

In [131]:
print(orders_df)

   OrderID CustomerName   Product     Category  Quantity  PricePerUnit  \
0      101        Alice   T-Shirt     Clothing         2         500.0
1      102          Bob     Shoes     Footwear         1        2000.0
2      103      Charlie  Trousers     Clothing         3           NaN
3      104        David   T-Shirt     Clothing         5         500.0
4      105          Eva     Shoes     Footwear         2        2200.0
5      106        Frank       Hat  Accessories         4         300.0
6      107        Grace   T-Shirt     Clothing         1         550.0
7      108        Helen  Trousers     Clothing         2        1100.0

    OrderDate       City  TotalAmount
0  01-09-2025      Delhi       1000.0
1  02-09-2025     Mumbai       2000.0
2  02-09-2025      Delhi          NaN
3  03-09-2025  Bangalore       2500.0
4  03-09-2025    Chennai       4400.0
5  04-09-2025     Mumbai       1200.0
6  05-09-2025      Delhi        550.0
7  05-09-2025    Chennai       2200.0

In [132]:
print(orders_df.head()) # prints the first 5 rows of the dataframe.

   OrderID CustomerName   Product  Category  Quantity  PricePerUnit  \
0      101        Alice   T-Shirt  Clothing         2         500.0
1      102          Bob     Shoes  Footwear         1        2000.0
2      103      Charlie  Trousers  Clothing         3           NaN
3      104        David   T-Shirt  Clothing         5         500.0
4      105          Eva     Shoes  Footwear         2        2200.0

    OrderDate       City  TotalAmount
0  01-09-2025      Delhi       1000.0
1  02-09-2025     Mumbai       2000.0
2  02-09-2025      Delhi          NaN
3  03-09-2025  Bangalore       2500.0
4  03-09-2025    Chennai       4400.0

In [133]:
print(orders_df.info()) # prints the info about all the columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       8 non-null      int64
 1   CustomerName  8 non-null      object
 2   Product       8 non-null      object
 3   Category      8 non-null      object
 4   Quantity      8 non-null      int64
 5   PricePerUnit  7 non-null      float64
 6   OrderDate     8 non-null      object
 7   City          8 non-null      object
 8   TotalAmount   7 non-null      float64
dtypes: float64(2), int64(2), object(5)
memory usage: 708.0+ bytes
None

In [134]:
print(orders_df.describe()) # Gives out the basic counts and metrics about the columns with numbers.

         OrderID  Quantity  PricePerUnit  TotalAmount
count    8.00000  8.000000      7.000000     7.000000
mean   104.50000  2.500000   1021.428571  1978.571429
std      2.44949  1.414214    778.811671  1277.320484
min    101.00000  1.000000    300.000000   550.000000
25%    102.75000  1.750000    500.000000  1100.000000
50%    104.50000  2.000000    550.000000  2000.000000
75%    106.25000  3.250000   1550.000000  2350.000000
max    108.00000  5.000000   2200.000000  4400.000000

In [135]:
print(orders_df.iloc[0]) # prints the selected row of the dataframe

OrderID                101
CustomerName         Alice
Product            T-Shirt
Category          Clothing
Quantity                 2
PricePerUnit         500.0
OrderDate       01-09-2025
City                 Delhi
TotalAmount         1000.0
Name: 0, dtype: object

In [136]:
print(orders_df['OrderID']) # prints the selected column of the dataframe

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
Name: OrderID, dtype: int64

In [137]:
print(pd.options.display.max_rows) # prints the maximum number of rows to display
pd.options.display.max_rows = 50  # sets the maximum number of rows to display

50

In [138]:
print(pd.options.display.max_rows) # prints the maximum number of rows to display

50

In [139]:
print(orders_df)

   OrderID CustomerName   Product     Category  Quantity  PricePerUnit  \
0      101        Alice   T-Shirt     Clothing         2         500.0
1      102          Bob     Shoes     Footwear         1        2000.0
2      103      Charlie  Trousers     Clothing         3           NaN
3      104        David   T-Shirt     Clothing         5         500.0
4      105          Eva     Shoes     Footwear         2        2200.0
5      106        Frank       Hat  Accessories         4         300.0
6      107        Grace   T-Shirt     Clothing         1         550.0
7      108        Helen  Trousers     Clothing         2        1100.0

    OrderDate       City  TotalAmount
0  01-09-2025      Delhi       1000.0
1  02-09-2025     Mumbai       2000.0
2  02-09-2025      Delhi          NaN
3  03-09-2025  Bangalore       2500.0
4  03-09-2025    Chennai       4400.0
5  04-09-2025     Mumbai       1200.0
6  05-09-2025      Delhi        550.0
7  05-09-2025    Chennai       2200.0

In [140]:
cleaned_orders_df = orders_df.dropna() # drops all the rows with NaN values

In [141]:
orders_df

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City,TotalAmount
0,101,Alice,T-Shirt,Clothing,2,500.0,01-09-2025,Delhi,1000.0
1,102,Bob,Shoes,Footwear,1,2000.0,02-09-2025,Mumbai,2000.0
2,103,Charlie,Trousers,Clothing,3,NaN,02-09-2025,Delhi,NaN
3,104,David,T-Shirt,Clothing,5,500.0,03-09-2025,Bangalore,2500.0
4,105,Eva,Shoes,Footwear,2,2200.0,03-09-2025,Chennai,4400.0
5,106,Frank,Hat,Accessories,4,300.0,04-09-2025,Mumbai,1200.0
6,107,Grace,T-Shirt,Clothing,1,550.0,05-09-2025,Delhi,550.0
7,108,Helen,Trousers,Clothing,2,1100.0,05-09-2025,Chennai,2200.0

In [142]:
cleaned_orders_df

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City,TotalAmount
0,101,Alice,T-Shirt,Clothing,2,500.0,01-09-2025,Delhi,1000.0
1,102,Bob,Shoes,Footwear,1,2000.0,02-09-2025,Mumbai,2000.0
3,104,David,T-Shirt,Clothing,5,500.0,03-09-2025,Bangalore,2500.0
4,105,Eva,Shoes,Footwear,2,2200.0,03-09-2025,Chennai,4400.0
5,106,Frank,Hat,Accessories,4,300.0,04-09-2025,Mumbai,1200.0
6,107,Grace,T-Shirt,Clothing,1,550.0,05-09-2025,Delhi,550.0
7,108,Helen,Trousers,Clothing,2,1100.0,05-09-2025,Chennai,2200.0

In [143]:
replaced_df = orders_df.fillna(0) # replaces all the NaN values with 0
new_replaced_df = orders_df.fillna({"PricePerUnit": 0, "TotalAmount": 0}) # replaces all the NaN values with 0, for a specific column
new_replaced_df

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City,TotalAmount
0,101,Alice,T-Shirt,Clothing,2,500.0,01-09-2025,Delhi,1000.0
1,102,Bob,Shoes,Footwear,1,2000.0,02-09-2025,Mumbai,2000.0
2,103,Charlie,Trousers,Clothing,3,0.0,02-09-2025,Delhi,0.0
3,104,David,T-Shirt,Clothing,5,500.0,03-09-2025,Bangalore,2500.0
4,105,Eva,Shoes,Footwear,2,2200.0,03-09-2025,Chennai,4400.0
5,106,Frank,Hat,Accessories,4,300.0,04-09-2025,Mumbai,1200.0
6,107,Grace,T-Shirt,Clothing,1,550.0,05-09-2025,Delhi,550.0
7,108,Helen,Trousers,Clothing,2,1100.0,05-09-2025,Chennai,2200.0

In [146]:
mean_price_per_unit = orders_df['PricePerUnit'].mean() # calculates the mean of the PricePerUnit column
new_replaced_df = orders_df.fillna({"PricePerUnit": mean_price_per_unit, "TotalAmount": 0}) # replaces all the NaN values with mean of PricePerUnit column, for a specific column
new_replaced_df

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City,TotalAmount
0,101,Alice,T-Shirt,Clothing,2,500.000000,01-09-2025,Delhi,1000.0
1,102,Bob,Shoes,Footwear,1,2000.000000,02-09-2025,Mumbai,2000.0
2,103,Charlie,Trousers,Clothing,3,1021.428571,02-09-2025,Delhi,0.0
3,104,David,T-Shirt,Clothing,5,500.000000,03-09-2025,Bangalore,2500.0
4,105,Eva,Shoes,Footwear,2,2200.000000,03-09-2025,Chennai,4400.0
5,106,Frank,Hat,Accessories,4,300.000000,04-09-2025,Mumbai,1200.0
6,107,Grace,T-Shirt,Clothing,1,550.000000,05-09-2025,Delhi,550.0
7,108,Helen,Trousers,Clothing,2,1100.000000,05-09-2025,Chennai,2200.0